
'''
* 튜플 (tuple)

- 튜플은 값의 집합이라는 측면에서 리스트와 유사하지만
값을 한번 저장한 후에는 내부 요소의 편집이 불가능

-튜플은 상수리스트라고도 부르며 ()를 사용해서 표현합니다.

-튜플도 문자열과 리스트와 마찬가지로 시퀀스 자료형이다
'''

points = (87,97,23,45,100)
print(type(points))

sum = 0
for p in points:
    sum += p

print(f'총점: {sum}점, 평균: {sum/len(points)}점')

# 튜플을 만들 때는 ()를 생략할 수 있다.
print('-'*40)

tu = 1,3,5,7,9

#튜플은 리스트와 마찬가지로 unpackaging이 가능하다.








'''
튜플로 가능한 일은 리스트로 모두 가능하다
리스트는 튜플에 비해 요소를 편집하는 행위도 가능하다.
결국 리스트는 튜플의 기능을 모두 포괄하는 더 큰 범위의 타입이지만, 
튜플을 사용해야하는 이유는 존재한다.

1.비용의 차이: 리스트는 변경의 가능성을 항상 대비해야 하기 때문에
더 많은 메모리 공간을 차지하고, 속도도 그만큼 느리다
이에비해, 튜플은 값의 집합만 표현할 뿐 바뀔 일이 없으므로
내부 구조가 더 단순하고 속도도 빠르다

2. 데이터 안정성: 리스트는 실수로 내부 데이터가 의도치 않게 바뀔 위험이 있지만,
튜플은 한번 정해지면 바뀔 수가 없기 때문에 
실수할 위험이 적다
데이터 베이스나 네트워크에서 얻은 데이터는 단순히
참조만 하면 될뿐 편집할 일이 많지 않다
그렇기 때문에 리스트로 관리하는 것보다 튜플로 처리하는것이 안전하다

3. 리스트와 상호 변경이 자유로움: 리스트와 튜플은
값 변경 가능성 여부만 다를뿐 구조가 상당히 유사하다
리스트를 튜플로 변환 할 때는 내장함수list()를 사용하고
튜플을 리스트로 변환할 때는 내장함수 tuple()을 사용한다.
'''

p = [2,3,4,5,6]
p = tuple(p)
# p[1] = 3 (x) 튜플에서는 값의 변경이 불가능
p = list(p)
p[3] = 100
p.append(17)
print(p)
