
'''
*탈출문 (흐름제어문) - break, continue, return

-반복문은 조건을 만족하는 동안 계속 반복 실행하기 때문에
한 번 반복이 시작되면 반복횟수가 끝날때 까지
멈추지 않고 반복을 실행한다

- 하지만 중간에 어떤 이유로 반복을 중지해야 한다거나
현재 반복을 건너 뛰어야 할 경우에 탈출문을 사용한다.

*break
- break는 현재 반복문을 즉시 
'''


for n in range(1,11):
    if n == 7:
        break
    print(n, end=' ')
print('반복문 종료')

points = [92,56,77,-33,48]
for p in points:
    if p<0 or p>100:
        print('문제가 발생했습니다')
        print('문제가 있는 점수: ', p)
        break
    print(p, '점 처리 완료')    


'''
*무한 루프

- 무한 루프는 반복 횟수를 정하지 않고 무한하게 반복문을 
실행하는 구조

- 사전에 정확한 반복 횟수를 알 수 없을 때 구현한다.
 탈출문을 통해 종료할 수 있도록 설계한다.
'''

print('먹고싶은 음식을 입력하세요')
print('입력을 중지하려면 "그만"을 입력하세요')

while True:
    food = input('>')
    if food == '그만':
        print('입력을 종료합니다')
        break

print('프로그램 종료')